"""
3) Descubra a lógica e complete o próximo elemento:

a) 1, 3, 5, 7, ___

b) 2, 4, 8, 16, 32, 64, ____

c) 0, 1, 4, 9, 16, 25, 36, ____

d) 4, 16, 36, 64, ____

e) 1, 1, 2, 3, 5, 8, ____

f) 2,10, 12, 16, 17, 18, 19, ____  


Solução: 

a) 1, 3, 5, 7, 9    -> x+2

b) 2, 4, 8, 16, 32, 64, 128   -> x += x

c) 0, 1, 4, 9, 16, 25, 36, 49   -> sequência natural ^2

d) 4, 16, 36, 64, 100   ->  10^2

e) 1, 1, 2, 3, 5, 8, 13   -> (x += número anterior)

f) 2,10, 12, 16, 17, 18, 19, 200  -> Naturais com a letra "D"

"""